diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <comment>Обслуживание клиента</comment>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	
	// добавим информацию по данным до момента проводки
	ДокументПервоначальный = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот, Специалист, Проведен");	
	
	Для каждого Элемент Из ДокументПервоначальный Цикл
		ДополнительныеСвойства.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)

    // определим данные договора
    ДанныеДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора, ВКМ_Нормочас, ВКМ_ДатаНачала, ВКМ_ДатаОкончания");
    //ДокументПервоначальный = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ВремяНачалаРабот, ВремяОкончанияРабот, ДатаПроведенияРабот, Специалист");

	// проверки
	Если ДанныеДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Возврат;
	КонецЕсли;
	
	// проверка на даты
	Если Дата < ДанныеДоговора.ВКМ_ДатаНачала Или
	     Дата > ДанныеДоговора.ВКМ_ДатаОкончания Тогда
	    Отказ = Истина; 	
	    ТекстОшибки = СтрШаблон("Дата документа не соответствует периоду действия договора (с %1 по %2)",
	                            Формат(ДанныеДоговора.ВКМ_ДатаНачала, "ДФ=dd.MM.yy;"), 
	                            Формат(ДанныеДоговора.ВКМ_ДатаОкончания, "ДФ=dd.MM.yy;"));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Дата");     	
	КонецЕсли;
	
	// определение изменения для регистрации текста
	ЗарегистрироватьИзменения(ЭтотОбъект);
		 
	// заполнение регистра ВКМ_ВыполненныеКлиентуРаботы 
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Для Каждого ТекСтрокаВыполненныеРаботы из ВыполненныеРаботы Цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = Движение.КоличествоЧасов * ДанныеДоговора.ВКМ_Нормочас;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ЗарегистрироватьИзменения(Документ)
	
	Если Не ЗначениеЗаполнено(Документ.ДополнительныеСвойства.Проведен) Тогда
	    // если документ новый
		ТекстСпециалисту = СтрШаблон("Поступил заказ на обслуживание клиента %1 от %2. Назначен специалист %3 на дату %4 с %5 до %6",
		                             Документ.Номер, 
		                             Формат(Документ.Дата, "ДФ=dd.MM.yyyy;"),
		                             Формат(Документ.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"),
		                             Формат(Документ.ВремяНачалаРабот, "ДЛФ=T; ДП=-;"),
		                             Формат(Документ.ВремяОкончанияРабот, "ДЛФ=T; ДП=-;")); 
	Иначе		
		// если сделаны изменения
		ТекстИзмененияСпециалиста = "";
		ТекстИзмененияДаты = "";
		ТекстИзмененияВемени = "";
		ТекстИзменения = "";
		Если Документ.Специалист <> Документ.ДополнительныеСвойства.Специалист Тогда
			ТекстИзмененияСпециалиста = СтрШаблон("Назначен новый специалист %1", Документ.Специалист); 
		КонецЕсли;
		Если Документ.ДатаПроведенияРабот <> Документ.ДополнительныеСвойства.ДатаПроведенияРабот Тогда
			ТекстИзмененияДаты = СтрШаблон("Изменена дата проведения работ на %1", Формат(Документ.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;")); 
		КонецЕсли;	
		Если Документ.ВремяНачалаРабот <> Документ.ДополнительныеСвойства.ВремяНачалаРабот Или
		     Документ.ВремяОкончанияРабот <> Документ.ДополнительныеСвойства.ВремяОкончанияРабот Тогда
			ТекстИзмененияВемени = СтрШаблон("Изменено время проведения работ с %1 до %2", 
			                                      Формат(Документ.ВремяНачалаРабот, "ДЛФ=T; ДП=-;"),
					                              Формат(Документ.ВремяОкончанияРабот, "ДЛФ=T; ДП=-;")); 
		КонецЕсли;	
	
		ТекстИзменения = СтрШаблон("%1 %2 %3",
		                           ТекстИзмененияСпециалиста,
		                           ТекстИзмененияДаты,
		                           ТекстИзмененияВемени);
	    ТекстИзменения = СокрЛП(ТекстИзменения);	                           
		ТекстСпециалисту = СтрШаблон("Изменен заказ на обслуживание клиента %1 от %2. %3",
		                             Документ.Номер, 
		                             Формат(Документ.Дата, "ДФ=dd.MM.yyyy;"),
		                             ТекстИзменения); 
	КонецЕсли;	         
	Если Не ЗначениеЗаполнено(ТекстСпециалисту) Тогда
		// новый текст отправлять не надо
		Возврат;
	КонецЕсли;		                 
	
	// сохраним в справочник сообщений
	НовоеУведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	НовоеУведомление.Текст = ТекстСпециалисту;
	НовоеУведомление.Записать();
	
КонецПроцедуры
#КонецОбласти
